{
  "character_type": "healing",
  "personality_type": "healing",
  "emotions": {
    "happy": {
      "inactive": [
        "こんにちは！お会いできて嬉しいです！",
        "素敵な一日になりますように〜",
        "今日も一緒に楽しい時間を過ごしましょう！"
      ],
      "focus": [
        "集中している姿が本当に素敵です！",
        "もう少し集中してみてください。よくやっていますよ！",
        "落ち着いて集中している姿が素敵ですね〜"
      ],
      "rest": [
        "休憩は次の活動のためのエネルギーを充電する時間です〜",
        "快適に休んでいますか？心に余裕を持ってみてください",
        "少し休んで気持ちを整えてみてください"
      ],
      "completed": [
        "目標を達成しました！本当に素晴らしいですね！",
        "素晴らしい成果です！今日も一歩成長しましたね",
        "完了しました！自分を褒めてあげてください〜"
      ],
      "stopped": [
        "一時停止しましたね。大丈夫ですか？",
        "必要なだけゆっくり休んでも大丈夫ですよ",
        "いつでも再開する準備ができています"
      ]
    },
    "sad": {
      "inactive": [
        "今日の調子はいかがですか？ゆっくり始めましょうか？",
        "辛いことがありましたか？一緒に乗り越えましょう",
        "憂鬱な天気のように感じますか？少しずつ良くなりますよ"
      ],
      "focus": [
        "集中できなくても大丈夫です。リラックスした気持ちでやってみてください",
        "少しずつ進んでも大丈夫です。一緒にやっていくうちに良くなりますよ",
        "プレッシャーを感じないでください。今この瞬間だけに集中してみましょう"
      ],
      "rest": [
        "十分に休んでも大丈夫です。心をケアする時間が必要です",
        "時には完全な休息が必要な時もあります",
        "辛かった分だけしっかり休みましょう。明日はもっと良くなりますよ"
      ],
      "completed": [
        "困難の中でもやり遂げましたね！本当に誇らしいです",
        "今日の小さな達成が明日の大きな喜びになるでしょう",
        "困難の中でも最後までやり遂げるなんて尊敬します"
      ],
      "stopped": [
        "大丈夫ですよ、休憩してもいいですよ",
        "辛い時は無理をしないでください",
        "次回また始めても大丈夫です"
      ]
    },
    "worried": {
      "inactive": [
        "何か心配事がありますか？",
        "一緒にゆっくり始めましょう。そばにいますよ",
        "心配があるなら、始める前に少し心を落ち着かせてみてください"
      ],
      "focus": [
        "集中の妨げになるものがありますか？深呼吸をしてみてください",
        "ペースを少し遅くしても大丈夫です。心が穏やかなほうが集中できます",
        "心配は一旦置いておいて、今この瞬間だけに集中してみませんか？"
      ],
      "rest": [
        "休憩時間に心の負担を少し降ろしてください",
        "目を閉じて深呼吸してみるのはいかがですか？",
        "ストレッチをして緊張をほぐしてみてください"
      ],
      "completed": [
        "心配の中でも最後までやり遂げましたね！素晴らしいです！",
        "小さな成功が大きな自信につながるでしょう",
        "一つの心配が解決したようですね。お疲れ様でした！"
      ],
      "stopped": [
        "突然止まりましたね。何かありましたか？心配です",
        "続けられなかった理由がありますか？大丈夫か心配です",
        "途中でやめるのは残念です。何があったか教えていただけますか？"
      ]
    },
    "sleepy": {
      "inactive": [
        "今日は少し疲れているようですね。無理しないでください",
        "十分な睡眠は健康の基本です。今日は早く寝るのはいかがですか？",
        "眠いなら、短い昼寝も役立つかもしれません"
      ],
      "focus": [
        "眠気があっても、もう少し集中してみましょうか？",
        "少しストレッチをしてから再開するのはいかがですか？",
        "水を一杯飲んでから再び集中してみてください。役立つかもしれません"
      ],
      "rest": [
        "休憩時間に目を閉じて深く呼吸してみてください",
        "短い昼寝をするのも良い方法です",
        "疲労を和らげるストレッチをしてみてください"
      ],
      "completed": [
        "疲れた状態でも目標を達成しましたね！本当にすごいです！",
        "簡単なことではなかったでしょうに、やり遂げましたね！",
        "これでゆっくり休めますね。本当にお疲れ様でした！"
      ],
      "stopped": [
        "とても疲れているようです。休憩してください",
        "無理をしないでください。健康が第一です",
        "十分な休息が必要そうです。明日また始めても大丈夫ですよ"
      ]
    },
    "excited": {
      "inactive": [
        "わあ！今日も素晴らしい一日を過ごす準備ができていますか？",
        "ようこそ！今日も一緒に健康な一日を過ごしましょう！",
        "お会いできて嬉しいです！今日はどんな目標に向かって進みますか？"
      ],
      "focus": [
        "とても上手くやっていますよ！このまま続けてください！",
        "集中している姿が素晴らしいです！頑張ってください！",
        "素晴らしい集中力です！このまま維持してみてください！"
      ],
      "rest": [
        "エネルギー充電中！ストレッチもしてみませんか？",
        "休憩しながら次の活動のためのエネルギーを集めましょう",
        "休憩中も元気に！軽く体を動かすのも良いですよ！"
      ],
      "completed": [
        "わあ！見事にやり遂げましたね！おめでとうございます！",
        "目標達成！本当に素晴らしいです！",
        "無事に完了しました！自分に拍手を送ってください！"
      ],
      "stopped": [
        "エネルギーを集めるために一時停止していますか？",
        "いつでも再開する準備ができています！",
        "時には立ち止まって考える時間も必要ですね！"
      ]
    },
    "normal": {
      "inactive": [
        "こんにちは！お待ちしていました！",
        "今日はどんな計画がありますか？",
        "一緒に健康的な習慣を作りましょう！"
      ],
      "focus": [
        "落ち着いて集中していますね",
        "集中している姿が素敵です",
        "静かに応援していますよ"
      ],
      "rest": [
        "リラックスして休憩してください",
        "休憩を取ることも大切です",
        "休息も計画の一部です"
      ],
      "completed": [
        "目標を達成しました！お疲れ様でした！",
        "落ち着いて最後までやり遂げましたね。素晴らしいです！",
        "完了しました。達成感を感じてみてください！"
      ],
      "stopped": [
        "タイマーが止まりました。続ける準備はできていますか？",
        "一時停止しましたね。何かありましたか？",
        "いつでも再開する準備ができています"
      ]
    },
    "disappointed": {
      "inactive": [
        "今日は何か残念なことがありましたか？",
        "小さな失敗も経験になります",
        "一緒にもう一度始めましょう、大丈夫ですよ"
      ],
      "focus": [
        "集中できなくても大丈夫です。挑戦すること自体に意味があります",
        "小さな進歩も称賛に値します",
        "今この瞬間だけに集中してみてください"
      ],
      "rest": [
        "休憩しながら気持ちを整理する時間を持ってください",
        "時には一歩下がって見つめ直すことも重要です",
        "次はもっとうまくできるでしょう"
      ],
      "completed": [
        "満足いかなくても最後までやり遂げましたね！",
        "完了すること自体が成功です。お疲れ様でした！",
        "後悔があっても、経験を通じて成長できます"
      ],
      "stopped": [
        "目標を完了できませんでしたね...残念ですが、次回は必ず達成できるよう願っています",
        "途中で止まってしまって残念です。次回は最後までできるでしょう",
        "完了できなかったのは残念です。もう一度挑戦してみませんか？"
      ]
    },
    "proud": {
      "inactive": [
        "今日も素晴らしい一日を過ごす準備はできていますか？",
        "自信に満ちた姿が素敵ですね！",
        "今日も一緒に素晴らしい成果を上げましょう！"
      ],
      "focus": [
        "一生懸命集中している姿が誇らしいです",
        "あなたの努力が輝く瞬間です",
        "このように努力する姿が本当に素晴らしいです"
      ],
      "rest": [
        "素晴らしい休息も達成の一部です",
        "効率的に休憩しましょう！次の活動のための準備時間です",
        "自分をケアする時間を持つことも重要です"
      ],
      "completed": [
        "すごい！目標を完璧に達成しました！",
        "素晴らしい成果です！心からおめでとうございます！",
        "あなたの達成を本当に誇りに思います！"
      ],
      "stopped": [
        "大丈夫ですよ！いつでも再挑戦できます！",
        "一時停止しましたが、あなたの能力は依然として素晴らしいです！",
        "次回はさらに素晴らしい成果を上げることができるでしょう！"
      ]
    }
  },
  "timer_state_messages": {
    "focus": {
      "start": {
        "happy": [
          "楽しい気持ちで集中時間を始めましょうか？",
          "良い気分で集中しましょう！あなたの努力が輝くでしょう！",
          "幸せなエネルギーに満ちた集中時間になりますように！"
        ],
        "sad": [
          "辛くても、ゆっくりと集中してみてください。一緒に乗り越えましょう",
          "気分が沈んでいても、小さな一歩が大きな変化につながります",
          "心が重くても大丈夫です。この瞬間だけに集中してみませんか？"
        ],
        "worried": [
          "心配は一旦置いておいて集中してみてください。応援していますよ",
          "深呼吸をしてゆっくり始めましょうか？",
          "不安があるなら、一旦置いておいて今だけに集中しましょう"
        ],
        "sleepy": [
          "少し疲れているようですね。それでも始めてみましょうか？",
          "眠気があっても、始めることが半分の成功です。ゆっくり集中しましょう",
          "疲れていても、短時間でも集中すれば達成感を得られますよ"
        ],
        "excited": [
          "エネルギッシュな集中時間を始めましょうか？ファイト！",
          "その情熱のまま集中してください！素晴らしい結果があるでしょう！",
          "活気あるエネルギーで集中しましょう！あなたの情熱が輝く時間です！"
        ],
        "normal": [
          "集中時間が始まりました！落ち着いて集中してください。",
          "集中モードが始まりました！一緒に頑張りましょう！",
          "今は集中する時間です。リラックスして始めてみてください。"
        ],
        "disappointed": [
          "何か失望することがあっても、集中することで気分が良くなるかもしれません",
          "小さな達成も大きな慰めになります。始めてみませんか？",
          "後悔があっても、この瞬間に集中してみてください"
        ],
        "proud": [
          "その自信に満ちた表情で集中してください！素晴らしいです！",
          "その誇りを持って集中してください！さらなる達成が待っています！",
          "自分の能力を信じて集中してください！素晴らしい結果があるでしょう！"
        ]
      },
      "middle": [
        "あと{remaining_minutes}分です。よくやっていますよ！",
        "まだ{remaining_minutes}分あります。もう少し集中してみませんか？",
        "集中していますか？あと{remaining_minutes}分で休憩できますよ。"
      ],
      "end": [
        "もうすぐ集中時間が終わります！まとめてください。",
        "もう少し集中してください！もうすぐ休憩時間です〜",
        "もう少しです！最後まで頑張ってください！"
      ]
    },
    "rest": {
      "start": {
        "happy": [
          "楽しい休憩時間です！十分にリチャージしてください〜",
          "気持ちの良い休憩を始めましょうか？リラックスしてください",
          "楽しく休憩する時間も大切です。余暇を楽しんでください！"
        ],
        "sad": [
          "休憩時間には心を慰めてください。大丈夫になりますよ",
          "悲しい心も休息が必要です。ゆっくり休んでください",
          "心が重いときこそ、深い休息が必要です"
        ],
        "worried": [
          "心配事は一旦置いて、心を休ませてください",
          "休憩時間には全ての心配を置いておきましょう",
          "不安な心も休息が必要です。リラックスして呼吸してみてください"
        ],
        "sleepy": [
          "疲れていますか？目を閉じて少し休んでみませんか？",
          "休憩時間に短い昼寝をしても良いですよ",
          "疲労を和らげるために十分に休んでください"
        ],
        "excited": [
          "活気ある休憩も良いですね！軽く体を動かしてみませんか？",
          "情熱的な休憩時間でエネルギーを再充電しましょう！",
          "楽しい気持ちで休憩をとってください！"
        ],
        "normal": [
          "休憩時間です！リラックスしてください。",
          "一息つく時間です。ゆっくり休んでください。",
          "今は休憩する時間です。心を落ち着かせてください。"
        ],
        "disappointed": [
          "休憩時間に心を慰めてください。すべて大丈夫になりますよ",
          "何か失望することがあれば、この時間に忘れてみてください",
          "後悔も置いておいて、少し休憩してください"
        ],
        "proud": [
          "誇らしい達成の後の休息はさらに甘いものです！",
          "素晴らしい成果を上げたあなた、ゆっくりと休んでください！",
          "誇りを持ってリラックスした休憩を楽しんでください！"
        ]
      },
      "middle": [
        "あと{remaining_minutes}分休めます。十分に休憩してください。",
        "ゆっくり休んでいますか？あと{remaining_minutes}分休めますよ。",
        "休憩中です〜あと{remaining_minutes}分です。"
      ],
      "end": [
        "もうすぐ休憩時間が終わります。再開する準備をしましょうか？",
        "休憩がもうすぐ終わります。再開する準備はできていますか？",
        "もうすぐ再開します。心の準備をしましょうか？"
      ]
    }
  },
  "adherence_feedback": {
    "high": [
      "今日は本当によくできました！健康を気遣う姿が素敵です〜",
      "素晴らしいです！定期的な休憩は長期的な健康と生産性を高めます。",
      "休息の習慣が完璧です！健康的な生活バランスを上手く保っていますね！"
    ],
    "medium": [
      "もう少し休息が必要です。一緒に健康を守りましょう〜",
      "バランスが大切です。もう少し休息に時間を投資してみてください。",
      "時には十分に休んでください。持続可能な習慣が重要です。"
    ],
    "low": [
      "健康が最も重要です。無理せずペースを守ってください〜",
      "休息の質が次のパフォーマンスを決定します。十分に休んでください。",
      "休憩が足りていませんね。明日はもう少し頻繁に休んでみてください〜"
    ]
  }
} 